/* #1 створити масив з: з 5 числових значень; з 5 стічкових значень; з 5 значень стрічкового, числового та булевого типу; та вивести його в консоль */
/* const str = ['hello', 'world', 'how', 'are', 'you'];
const num = [1, 366, -71, 3.145, -0.332];
const mix = ['javascript is awesome', 753272187, true, [12, 'one'], false];
console.log(str, num, mix); */

/* #2 Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль */
/* const ar = [];
ar[0] = 'My';
ar[1] = 'name';
ar[2] = 'is';
ar[3] = 'Nataliia';
console.log(ar); */

/* #3  За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині */
/* for (let i = 0; i < 10; i++) {
    document.write(`<div>Блок div</div>`);
} */

/* #4 За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині */
/* for (let i = 0; i < 10; i++) {
    document.write(`<div>Блок div ${i}</div>`);
} */

/* #5 За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині. */
/* let i = 0;
while (i < 20) {
    document.write(`<h1>Заголовок h1</h1>`);
    i++;
} */

/* #6 За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині. */
/* let i = 0;
while (i < 20) {
    document.write(`<h1>Заголовок h1 ${i}</h1>`);
    i++;
} */

/* #7 Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі. */
/* const num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
for (const numI of num) {
    console.log(numI);
} */

/* #8 Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі. */
/* const str = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'];
for (const strI of str) {
    console.log(strI);
} */